# Ввести двухзначное число. Если сумма цифр числа четная, то увеличеть число на 2
# в протвном случае уменьшить на 2

a = input("Введите двузначное число: ")

while type(a) != int:  # обработка исключений
    try:
        a = int(a)
    except ValueError:
        print("Неправильно ввели!")
        a = input("Введите двузначное число: ")


chislo1 = a // 10
chislo2 = a % 10

if 10 <= a <= 99:
    
    if (chislo1 + chislo2) % 2 == 0:
        b = a + 2
    else:
        b = a - 2
    print(b)
else:
    print("Число не является двузначным!")

