# определить размер скидки в зависимости от потраченной суммы
# при покупке 500-1000р скидка 3%; при покупке 1000-1500р скидка 4%;
# при покупке 1500-2000р скидка 5%

a = input("Введите число: ")
while type(a) != int:
    try:
        a = int(a)
    except ValueError:
        print('Не правильно ввели!')
        a = input('Введите число: ')
if 500 <= a < 1000:
    print('Ваша скидка составляет 3%')
elif 1000 <= a < 1500:
    print('Ваша скидка составляет 4%')
elif 1500 <= a <= 2000:
    print('Ваша скидка составляет 5%')
else:
    print('На данную цену нет скидки!')
